BRB_Documentation/docs/SOAP/20130829_Tokenization Success.txt

--Tokenization Request


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
        xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"> 
        <soapenv:Body> 
                <transactRequest xmlns="http://ctfs.com/esocketTransactIo/"> 
                        <id>1226907</id> 
                        <transaction> 
                                <messageType>0600</messageType> 
                                <messageFields> 
                                        <processingCode> 
                                                <fromAccountType>00</fromAccountType> 
                                                <toAccountType>00</toAccountType> 
                                                <transactionType>91</transactionType> 
                                        </processingCode> 
                                        <expiryDate>1606</expiryDate> 
                                        <structuredData> 
                                                <entry> 
                                                        <name>ReferenceTransactionInfo</name> 
                                                        <data> 
                                                                &lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt; 
                                                                &lt;ReferenceTransactionInfo&gt; 
                                                                &lt;Request&gt; 
                                                                &lt;Channel&gt;WEBIC&lt;/Channel&gt; 
                                                                &lt;ICCVCPromptDate&gt;20130828134000&lt;/ICCVCPromptDate&gt; 
                                                                &lt;/Request&gt; 
                                                                &lt;/ReferenceTransactionInfo&gt; </data> 
                                                </entry> 
                                        </structuredData> 
                                        <extendedTransactionType>9750</extendedTransactionType> 
                                </messageFields> 
                                <pciMessageFields> 
                                        <pan>5259950227090886</pan> 
                                </pciMessageFields> 
                        </transaction> 
                        <tokenRequired>Y</tokenRequired> 
                        <agentIPAddress>172.23.38.12</agentIPAddress> 
                        <hostSystem>WEBIC</hostSystem> 
                        <hostSystemOperator>SYSTEM</hostSystemOperator> 
                </transactRequest> 
        </soapenv:Body> 
</soapenv:Envelope> 


--Tokenization Response
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <a:transactResponse xmlns:a="http://ctfs.com/esocketTransactIo/">
         <a:id>1226907</a:id>
         <a:transaction>
            <a:messageType>0610</a:messageType>
            <a:messageFields>
               <a:processingCode>
                  <a:fromAccountType>00</a:fromAccountType>
                  <a:toAccountType>00</a:toAccountType>
                  <a:transactionType>91</a:transactionType>
               </a:processingCode>
               <a:responseCode>00</a:responseCode>
               <a:structuredData>
                  <a:entry>
                     <a:name>ReferenceTransactionInfo</a:name>
                     <a:data><![CDATA[<?xml version="1.0" encoding="utf-8"?><ReferenceTransactionInfo><Response><ReferenceNumber>9305102858</ReferenceNumber><ReferenceExpiryDate>20130830102753</ReferenceExpiryDate></Response></ReferenceTransactionInfo>]]></a:data>
                  </a:entry>
               </a:structuredData>
               <a:extendedTransactionType>9750</a:extendedTransactionType>
               <a:pan>525995xxxxxx0886</a:pan>
            </a:messageFields>
         </a:transaction>
         <a:passFail>P</a:passFail>
         <a:responseCodes>0</a:responseCodes>
      </a:transactResponse>
   </soapenv:Body>
</soapenv:Envelope>